//1. Створити пустий масив та :
let massive50 = []


    console.log(" "); //  пробіл
//--------------------------------------------------------------------------------------------------//
// a. заповнити його 50 парними числами за допомоги циклу.

for (let i = 0; i <= 50; i++) {
    if (i % 2 === 0) {massive50.push(i)}
}
    console.log('50 парних',massive50);



    console.log(" "); //  пробіл
//----------------------------------------------------------------------------------------------------//
// b. заповнити його 50 непарними числами за допомоги циклу.

for (let i = 1; i <= 50; i+=2) {
    massive50.push(i)
}
    console.log('50 непарних',massive50);



    console.log(" "); //  пробіл
//------------------------------------------------------------------------------------------------------//
// c. Заповнити масив 20-ма рандомними числами. (Google: Generate random number JS)

for (let i = 0; i < 20; i++) {
    let randomNum = Math.floor(Math.random() * 101);
    massive50.push(randomNum);
}
    console.log('20 рандомних чисел',massive50);



    console.log(" "); //  пробіл
//-----------------------------------------------------------------------------------------------------------//
// d. Заповнити масив 20-ма рандомними числами в діапазоні від 8 до 732 (Google: Generate random number JS)

for (let i = 0; i < 20; i++) {
    let randomNum = Math.floor(Math.random() * (732 - 8 + 1))+8;
    massive50.push(randomNum);
}
    console.log('8 до 732',massive50);





    console.log(" "); //  пробіл
//----------------------------------------------------------------------------------------------//
//  2. Вивести за допомогою console.log кожен третій елемент

for (let i = 0; i < massive50.length; i += 3) {
    console.log("Кожен 3 елемент",massive50[i]);
}



    console.log(" "); //  пробіл
//-----------------------------------------------------------------------------------------------//
//  3. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним.

for (let i = 0; i < massive50.length; i += 3) {
    let value = massive50[i];
    if (value % 2 === 0) {
        console.log('Кожен 3-й парний',value);
    }
}




    console.log(" "); //  пробіл
//--------------------------------------------------------------------------------------------------------------//
//  4. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним, та записати їх в новий масив

let newMassive = []
for (let i = 0; i < massive50.length; i += 3) {
    let value = massive50[i];
    if (value % 2 === 0) {newMassive.push(value)
    }
}
    console.log('кожен 3 парний в новому масиві:',newMassive);




    console.log(" "); //  пробіл
//-----------------------------------------------------------------------------------------------//
//  5. Вивести кожен елемент масиву, сусід справа якого є парним

for (let i = 0; i < massive50.length - 1; i++) { // мінус , щоб не вийти за межі
    let current = massive50[i];
    let next = massive50[i + 1];         //сусід праворуч

    if (next % 2 === 0) {              //перев  сусіда праворуч
        console.log('сусід праворуч парний:',current);
    }
}





    console.log(" "); //  пробіл
//------------------------------------------------------------------------------------------------------------//
//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.

let transactions= [100,250,50,168,120,345,188]

let sum = 0;
for (let i = 0; i < transactions.length; i++) {
    sum += transactions[i];
}
let average = sum / transactions.length;

    console.log('середній чек',average);





    console.log(" "); //  пробіл
//-------------------------------------------------------------------------------------------------------------//
//  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.



const originalArray = [];
const newArray = [];

for (let i = 0; i < 10; i++) {
    let randomNum = Math.floor(Math.random() * 100) + 1;
    originalArray.push(randomNum);
    newArray.push(randomNum * 5);
}
    console.log("Оригінал:", originalArray);
    console.log("×5:", newArray);




    console.log(" "); //  пробіл
//------------------------------------------------------------------------------------------------------------//
//  8. Створити масив з будь-якими значеннями (стрінги, числа, і тд…). пройтись по ньому, і, якщо елемент є числом, додати його в інший масив.


let mixArray = [
    44,
    "Привіт",
    3.14,
    true,
    "JavaScript",
    100500,
    null,
    -5,
    false,
    0,
    undefined
];

let numbers = [];

for (let i = 0; i < mixArray.length; i++) {
    let item = mixArray[i];
    if (typeof item === 'number' && !isNaN(item)) {
        numbers.push(item);
    }
}
    console.log('Тільки числа:', numbers);