// #bq1zkx7WP
//
// *** (подібне було вище, але…будьте уважні в другій частині) створити сторінку з довільним блоком, в середині якого є значення “100грн”
//
// при перезавантаженні сторінки до значення додається по 10грн, але !!! зміна ціни відбувається тільки на перезавантаження, які відбулись пізніше ніж 10 секунд після попереднього.
//
//     При перезавантаженні, яке відбулось раніше ніж минуло 10 секунд, нічого не відбувається



let currentSum = +localStorage.getItem('number') || 90;
currentSum += 10;
localStorage.setItem('number', currentSum);
document.getElementById('blockWithSum').innerText = currentSum;

setTimeout(() => {
    location.reload();
}, 10000);
