//=======================================LESSON 53================================================//

//==========================ОБ'ЄКТНА МОДЕЛЬ ДОКУМЕНТА ТА ПОШУК ЕЛЕМЕНТІВ============================//

//DOM - документ сприймається як модель об'єкта
//Пошук елементів в DOM

// 1- група
// а) за ідентифікатором (id) document.getElementById('id')
//шукає елемент відштовхуючись від document або від останньогот знайденого елемента

// б) за Класом document.getElementsByClassName('клас')
//цей метод знаходить колекцію елементів. Для того, щоб витягнути кожен окремий елемент з колекції, потрібно проітерувати будь яким циклом, або звернутися за індексом, так як це той самий масим

// в) по ТЕГу document.getElementByTagName(`li`)
// наприклад, якщо нам потрібно витягнути елемент з певного класу в ДОМ
// нам потрібно
// let listCollection = document.getElementById('list-1')
// listCollection.document.getElementByTageName('li')


// 2-група
// а) document.querySelector() - повертає один і перший потрібний елемент за заданим CSS-селектором
// б)document.querySelectorAll() - повертає список вузлів з  потрібним елементом за заданим CSS-селектором
// але обов'язково, для того, щоб дістати елемент, потрібно вузол проітерувати будь яким циклом. (forOf)

// let nodeList= document.querySelector('.menu:nth-child(2))
// for(const node of nodeList) {console.log(node)}
