//число в стрінгу

console.log(typeof(100500 + ''));
console.log(100+200 + '');
console.log('' + 100 + 200);


//стрінгу в число

console.log(+'100500л');// (+) на початку - перетворює число в стрінгу, але якщо     додати в поряд з числом текст - в консолі  буде NaN (ще один тип даних)

console.log(parseInt('100500'));
console.log(parseFloat('100.500'));

//число в булеан

console.log(!!1000); // !! біля числового значення - отримаємо true
console.log(!!-1000); // від'ємні значення також true
console.log(!!0); // 0 це false

//стрінгу в булеан

console.log(!!'asd'); // !! true
console.log(!!''); // !! false (якщо 'нічого')
console.log(!!'0'); // !! true (якщо 'нуль') тому що нуль виступає текстовим стрінговим значенням і не має характеристик числового0

//булеан в стрінгу(число) вкрай рідко



