//Lesson42
//--------------------------Розширення конструкторів через PROTOTYPE---------------------------------//

//PROTOTYPE -

//Якщо у нас є функція-конструктор, в яку потрібно внести параметр (у випадку, якщо ф-конструктор мені не належить, або має обмеження прав доступу)

user.prototype.greeting = function () {}    //  впроваджуємо фукцію в конструктор (в шаблон)
//це означатиме, що будь який об'єкт, який створений за допомогою ф-коструктора (шаблона) буде містити в собі greeting (нашу впроваджену функцію)



//APPLY

user.greeting.apply(user2, )         // впроваджує в наступний об'єкт (user2) функцію greeting


//BIND

user2.greeting.bind(user2, 'hello', 'і т.д.')    // містить 2 і більше аргументів