//#WpkK0ZH1
//
// –створити масив з:
//
// – з 5 числових значень
//
// – з 5 стічкових значень
//
// – з 5 значень стрічкового, числового та булевого типу
//
// – та вивести його в консоль

let numbers = [1, 2, 3, 4, 5]
let stringers = ['art','ser','corn','snow','lesson']
let mixes = [6,7,8,9,10,'open','close','door','shop','goods',true, false, false, true, true]
console.log(numbers,stringers,mixes)

//----------------------------------------------------------------------------------------------//