//=================================LESSON 47=============================================//

///===================== Оператор опціональної послідовності ============================//

//одноокий елвіс / ?. / Використовується рідко. Використовується для обробки помилок
//наприклад:

let user = {};
user?.name    //не видає помилку//на будь який рівнях




//================================LESSON 48===============================================//

///============================= ES6 FEATURES ============================================//

//Скорочений синтаксис
let name = 'Art';
let age = 15;
let users = {name,age}    // замість name:name, age:age

//Деструктуризація - беру значення з іншого об'єкта у свій об'єкт

//Деструктуризація з ОБ'ЄКТАМИ

let options = {name01:'art',age01:31, wife:{nameQ:'Queen'}}
console.log(options);
let {name01:name011,age01:age011,wife:{nameQ:nameQQ}} = options;
console.log(name011)
console.log(age011)
console.log(nameQQ)

//Деструктуризація з МАСИВАМИ

let numbers = [11,22,33]
let [a, b,c] = numbers;
console.log(a,b,c)

//Деструктуризація МАСИВУ з ОБ'єктами

let usersCap = [
    {name03:'art', age03:22, status: false},
    {name03:'bart', age03:23, status: true},
    {name03:'cart', age03:24, status: true},
]
let [usersCap01, usersCap02] = usersCap;
let[{name03, age03, status} ]= usersCap;
console.log(usersCap01)




//====================================LESSON 49=============================================//

//================================ JS Spred ===================================================//
//це копіювання об'єкта (чи масива) в інший об'єкт (чи масив)  // ,,, - спред оператор

let fund = {id:1,name:'Fund'}; // з об'єктами
console.log(fund);
let fundCopy = {...fund};
console.log(fundCopy);
console.log(fundCopy === fund);


let funders = [{id:1,name:'Funders'}]; // з масивами
console.log(funders);
let fundersCopy = [...funders];
console.log(fundersCopy);
console.log(fundersCopy === funders);



//=================================LESSON 50=================================================//

//============================== Поверхневе та глибоке копіювання ===============================//

//ПОВЕРХНЕВЕ
let lessons = {name: 'artur', skills: ['html','js']};
let lessonsCopy = {...lessons};
console.log(lessons === lessonsCopy);
console.log(lessonsCopy.skills === lessons.skills);

//ГЛИБОКЕ Функція, що перетворює JS в JSON

//JSON.stringiFi() // Перетворює все у стрінгове значення.
//але при конвертації за допомогою функції json.stringifi() - втрачається поведінка (якщо у об'єкті, який ми клонуємо були функції - то вони не збережуться). JSON - спосіб передачі інформації у стрінговому вигляді.

let s = JSON.stringify(lessons)
console.log(s);                             // отримаємо стрінгове значення JSON

//ГЛИБОКЕ Функція, що перетворює JSON в JS

//object.parse()
let parse = JSON.parse(s);
console.log(parse);                        //отримаємо об'єкт js



//====================================LESSON 51=======================================//

//=================================== Prototyping (для співбесіди) =====================================//

//JS - це функціональна мова, яка є прототипно-орієнтованою
//JS - бере об''єкт і прототипіює його. Це аналогія з наслідуванням(в межах класів, шаблонів)
let base = {name: 'Art', age: 31};
let copyBase = Object.create(base)    // функція, яка робить копію
console.log(base)
console.log(copyBase)           // {} // але в ній є прототип з значеннями
console.log(copyBase.name)      // Art  // вивиодить в консоль значення

//щоб перевірити приналежність значення до того чи іншого об'єкта
console.log(copyBase.hasOwnProperty('name'));





//===================================LESSON 52=======================================//

//=================================DESCRIPTORS=============================================//

//Як об'єкт буде виглядати стосовно своїх характеристик
//Є функція, яка дозволяє додавати до полів об'єкта додаткові значення (зробити поле невидимим, зробити поле незмінним і т.д.)
//тобто, за допомогою дискріпторів, поля об'єкта можна ще додатково конфігурувати

object.defineProperty(copyBase, 'name')
//value
//writeble
//enumerable
//configurable









